Also impact the `AI Security Guardrails 2.0` profile:

```
 2024/08/29 13:01:29 Terraform plan | Terraform will perform the following actions:
2024/08/29 13:01:29 Terraform plan |
 2024/08/29 13:01:29 Terraform plan |   # module.create_profile_attachment["AI Security Guardrails 2.0"].ibm_scc_profile_attachment.scc_profile_attachment will be created
2024/08/29 13:01:29 Terraform plan |   + resource "ibm_scc_profile_attachment" "scc_profile_attachment" {
2024/08/29 13:01:29 Terraform plan |       + account_id            = (known after apply)
2024/08/29 13:01:29 Terraform plan |       + attachment_id         = (known after apply)
2024/08/29 13:01:29 Terraform plan |       + created_by            = (known after apply)
2024/08/29 13:01:29 Terraform plan |       + created_on            = (known after apply)
2024/08/29 13:01:29 Terraform plan |       + description           = "SCC profile attachment scoped to your specific IBM Cloud account id 85fbf4a5a3d148b1b75b59c610ecc811 with a daily attachment schedule."
2024/08/29 13:01:29 Terraform plan |       + id                    = (known after apply)
2024/08/29 13:01:29 Terraform plan |       + instance_id           = "ef71ef26-0e3f-400a-b0ee-0e879ef2d29d"
2024/08/29 13:01:29 Terraform plan |       + last_scan             = (known after apply)
2024/08/29 13:01:29 Terraform plan |       + name                  = "1 daily full account attachment"
2024/08/29 13:01:29 Terraform plan |       + next_scan_time        = (known after apply)
2024/08/29 13:01:29 Terraform plan |       + profile_attachment_id = (known after apply)
2024/08/29 13:01:29 Terraform plan |       + profile_id            = "7e09c417-238b-4dca-b086-22170bcf13ea"
2024/08/29 13:01:29 Terraform plan |       + schedule              = "daily"
2024/08/29 13:01:29 Terraform plan |       + status                = "enabled"
2024/08/29 13:01:29 Terraform plan |       + updated_by            = (known after apply)
2024/08/29 13:01:29 Terraform plan |       + updated_on            = (known after apply)
2024/08/29 13:01:29 Terraform plan |
 2024/08/29 13:01:29 Terraform plan |       + attachment_parameters {
2024/08/29 13:01:29 Terraform plan |           + assessment_id          = "rule-045ae3bc-9f3a-46ac-b4e9-7bec574f66d0"
2024/08/29 13:01:29 Terraform plan |           + assessment_type        = "automated"
2024/08/29 13:01:29 Terraform plan |           + parameter_display_name = "check for cbr enforcement"
2024/08/29 13:01:29 Terraform plan |           + parameter_name         = "check_enforced"
2024/08/29 13:01:29 Terraform plan |           + parameter_type         = "string_list"
2024/08/29 13:01:29 Terraform plan |           + parameter_value        = "['cbr', 'service']"
2024/08/29 13:01:29 Terraform plan |         }
2024/08/29 13:01:29 Terraform plan |       + attachment_parameters {
2024/08/29 13:01:29 Terraform plan |           + assessment_id          = "rule-064d9004-8728-4988-b19a-1805710466f6"
2024/08/29 13:01:29 Terraform plan |           + assessment_type        = "automated"
2024/08/29 13:01:29 Terraform plan |           + parameter_display_name = "Number of IBM Cloud Hyper Protect Crypto Service units"
2024/08/29 13:01:29 Terraform plan |           + parameter_name         = "hpcs_crypto_units"
2024/08/29 13:01:29 Terraform plan |           + parameter_type         = "string_list"
2024/08/29 13:01:29 Terraform plan |           + parameter_value        = "['2', '3']"
2024/08/29 13:01:29 Terraform plan |         }
2024/08/29 13:01:29 Terraform plan |       + attachment_parameters {
2024/08/29 13:01:29 Terraform plan |           + assessment_id          = "rule-0be41446-a0e7-46fb-8cbb-37bf413e0286"
2024/08/29 13:01:29 Terraform plan |           + assessment_type        = "automated"
2024/08/29 13:01:29 Terraform plan |           + parameter_display_name = "Minimal number of loadbalancer zones"
2024/08/29 13:01:29 Terraform plan |           + parameter_name         = "loadbalancer_min_lb_zones"
2024/08/29 13:01:29 Terraform plan |           + parameter_type         = "numeric"
2024/08/29 13:01:29 Terraform plan |           + parameter_value        = "3"
2024/08/29 13:01:29 Terraform plan |         }
2024/08/29 13:01:29 Terraform plan |       + attachment_parameters {
2024/08/29 13:01:29 Terraform plan |           + assessment_id          = "rule-0f7e7e60-a05c-43a7-be74-70615f14a342"
2024/08/29 13:01:29 Terraform plan |           + assessment_type        = "automated"
2024/08/29 13:01:29 Terraform plan |           + parameter_display_name = "Security group rule for allowed port numbers to DNS"
2024/08/29 13:01:29 Terraform plan |           + parameter_name         = "dns_port"
2024/08/29 13:01:29 Terraform plan |           + parameter_type         = "numeric"
2024/08/29 13:01:29 Terraform plan |           + parameter_value        = "53"
2024/08/29 13:01:29 Terraform plan |         }
2024/08/29 13:01:29 Terraform plan |       + attachment_parameters {
2024/08/29 13:01:29 Terraform plan |           + assessment_id          = "rule-11425765-ea68-47e7-b4e0-c443ec0cbd19"
2024/08/29 13:01:29 Terraform plan |           + assessment_type        = "automated"
2024/08/29 13:01:29 Terraform plan |           + parameter_display_name = "IP allowlist for Event Streams"
2024/08/29 13:01:29 Terraform plan |           + parameter_name         = "allowed_ip"
2024/08/29 13:01:29 Terraform plan |           + parameter_type         = "ip_list"
2024/08/29 13:01:29 Terraform plan |           + parameter_value        = "['192.168.1.0/24']"
2024/08/29 13:01:29 Terraform plan |         }
2024/08/29 13:01:29 Terraform plan |       + attachment_parameters {
2024/08/29 13:01:29 Terraform plan |           + assessment_id          = "rule-115d9567-067d-48c0-80b5-71642e0217fb"
2024/08/29 13:01:29 Terraform plan |           + assessment_type        = "automated"
2024/08/29 13:01:29 Terraform plan |           + parameter_display_name = "check for cbr enforcement"
2024/08/29 13:01:29 Terraform plan |           + parameter_name         = "check_enforced"
2024/08/29 13:01:29 Terraform plan |           + parameter_type         = "string_list"
2024/08/29 13:01:29 Terraform plan |           + parameter_value        = "['cbr', 'service']"
2024/08/29 13:01:29 Terraform plan |         }
2024/08/29 13:01:29 Terraform plan |       + attachment_parameters {
2024/08/29 13:01:29 Terraform plan |           + assessment_id          = "rule-28271605-31bb-4efa-b0ef-5f51adc77d90"
2024/08/29 13:01:29 Terraform plan |           + assessment_type        = "automated"
2024/08/29 13:01:29 Terraform plan |           + parameter_display_name = "Enter the IP/CIDR list allowed for VPC inbound"
2024/08/29 13:01:29 Terraform plan |           + parameter_name         = "inbound_allowed_list"
2024/08/29 13:01:29 Terraform plan |           + parameter_type         = "ip_list"
2024/08/29 13:01:29 Terraform plan |           + parameter_value        = "['0.0.0.0/0']"
2024/08/29 13:01:29 Terraform plan |         }
2024/08/29 13:01:29 Terraform plan |       + attachment_parameters {
2024/08/29 13:01:29 Terraform plan |           + assessment_id          = "rule-51e15d43-3946-4898-b593-02e16a988d8e"
2024/08/29 13:01:29 Terraform plan |           + assessment_type        = "automated"
2024/08/29 13:01:29 Terraform plan |           + parameter_display_name = "Maximum number of days between vulnerability scans"
2024/08/29 13:01:29 Terraform plan |           + parameter_name         = "scan_interval_max"
2024/08/29 13:01:29 Terraform plan |           + parameter_type         = "numeric"
2024/08/29 13:01:29 Terraform plan |           + parameter_value        = "3"
2024/08/29 13:01:29 Terraform plan |         }
2024/08/29 13:01:29 Terraform plan |       + attachment_parameters {
2024/08/29 13:01:29 Terraform plan |           + assessment_id          = "rule-574143f9-befe-4da1-a15e-af9437ed9ae7"
2024/08/29 13:01:29 Terraform plan |           + assessment_type        = "automated"
2024/08/29 13:01:29 Terraform plan |           + parameter_display_name = "Hyper Protect Crypto Services regions"
2024/08/29 13:01:29 Terraform plan |           + parameter_name         = "fs_cloud_regions"
2024/08/29 13:01:29 Terraform plan |           + parameter_type         = "string_list"
2024/08/29 13:01:29 Terraform plan |           + parameter_value        = "['au-syd', 'br-sao', 'ca-tor', 'eu-de', 'eu-gb', 'jp-osa', 'jp-tok', 'us-east', 'us-south']"
2024/08/29 13:01:29 Terraform plan |         }
2024/08/29 13:01:29 Terraform plan |       + attachment_parameters {
2024/08/29 13:01:29 Terraform plan |           + assessment_id          = "rule-61878b48-e181-455d-aed3-5730b6e27890"
2024/08/29 13:01:29 Terraform plan |           + assessment_type        = "automated"
2024/08/29 13:01:29 Terraform plan |           + parameter_display_name = "check for cbr enforcement"
2024/08/29 13:01:29 Terraform plan |           + parameter_name         = "check_enforced"
2024/08/29 13:01:29 Terraform plan |           + parameter_type         = "string_list"
2024/08/29 13:01:29 Terraform plan |           + parameter_value        = "['cbr', 'service']"
2024/08/29 13:01:29 Terraform plan |         }
2024/08/29 13:01:29 Terraform plan |       + attachment_parameters {
2024/08/29 13:01:29 Terraform plan |           + assessment_id          = "rule-857646d8-23b8-4495-82a4-295ab399266e"
2024/08/29 13:01:29 Terraform plan |           + assessment_type        = "automated"
2024/08/29 13:01:29 Terraform plan |           + parameter_display_name = "At least one VPC created"
2024/08/29 13:01:29 Terraform plan |           + parameter_name         = "number_of_vpcs"
2024/08/29 13:01:29 Terraform plan |           + parameter_type         = "numeric"
2024/08/29 13:01:29 Terraform plan |           + parameter_value        = "1"
2024/08/29 13:01:29 Terraform plan |         }
2024/08/29 13:01:29 Terraform plan |       + attachment_parameters {
2024/08/29 13:01:29 Terraform plan |           + assessment_id          = "rule-88f25dca-0e62-43c1-939e-f6637d23847f"
2024/08/29 13:01:29 Terraform plan |           + assessment_type        = "automated"
2024/08/29 13:01:29 Terraform plan |           + parameter_display_name = "Minimum number of Worker node zones"
2024/08/29 13:01:29 Terraform plan |           + parameter_name         = "worker_node_min_zones"
2024/08/29 13:01:29 Terraform plan |           + parameter_type         = "numeric"
2024/08/29 13:01:29 Terraform plan |           + parameter_value        = "3"
2024/08/29 13:01:29 Terraform plan |         }
2024/08/29 13:01:29 Terraform plan |       + attachment_parameters {
2024/08/29 13:01:29 Terraform plan |           + assessment_id          = "rule-898ff49d-1979-4b70-9a79-d303c88dea63"
2024/08/29 13:01:29 Terraform plan |           + assessment_type        = "automated"
2024/08/29 13:01:29 Terraform plan |           + parameter_display_name = "Exclude interfaces with IP-spoofing from VPC"
2024/08/29 13:01:29 Terraform plan |           + parameter_name         = "exclude_ip_spoofing_check"
2024/08/29 13:01:29 Terraform plan |           + parameter_type         = "string_list"
2024/08/29 13:01:29 Terraform plan |           + parameter_value        = "['vm-qa-automation-prod']"
2024/08/29 13:01:29 Terraform plan |         }
2024/08/29 13:01:29 Terraform plan |       + attachment_parameters {
2024/08/29 13:01:29 Terraform plan |           + assessment_id          = "rule-8c28c15e-c38f-410a-a883-a5f22a839176"
2024/08/29 13:01:29 Terraform plan |           + assessment_type        = "automated"
2024/08/29 13:01:29 Terraform plan |           + parameter_display_name = "Number of transit gateways"
2024/08/29 13:01:29 Terraform plan |           + parameter_name         = "number_of_transit_gateways"
2024/08/29 13:01:29 Terraform plan |           + parameter_type         = "numeric"
2024/08/29 13:01:29 Terraform plan |           + parameter_value        = "1"
2024/08/29 13:01:29 Terraform plan |         }
2024/08/29 13:01:29 Terraform plan |       + attachment_parameters {
2024/08/29 13:01:29 Terraform plan |           + assessment_id          = "rule-97b65986-fd31-459c-9a97-eaa6ad78944b"
2024/08/29 13:01:29 Terraform plan |           + assessment_type        = "automated"
2024/08/29 13:01:29 Terraform plan |           + parameter_display_name = "IP allowlist for COS"
2024/08/29 13:01:29 Terraform plan |           + parameter_name         = "allowed_ip"
2024/08/29 13:01:29 Terraform plan |           + parameter_type         = "ip_list"
2024/08/29 13:01:29 Terraform plan |           + parameter_value        = "['192.168.1.0/24']"
2024/08/29 13:01:29 Terraform plan |         }
2024/08/29 13:01:29 Terraform plan |       + attachment_parameters {
2024/08/29 13:01:29 Terraform plan |           + assessment_id          = "rule-a61e9ad4-1c26-4998-8862-502f0b1c20f5"
2024/08/29 13:01:29 Terraform plan |           + assessment_type        = "automated"
2024/08/29 13:01:29 Terraform plan |           + parameter_display_name = "check for cbr enforcement"
2024/08/29 13:01:29 Terraform plan |           + parameter_name         = "check_enforced"
2024/08/29 13:01:29 Terraform plan |           + parameter_type         = "string_list"
2024/08/29 13:01:29 Terraform plan |           + parameter_value        = "['cbr', 'service']"
2024/08/29 13:01:29 Terraform plan |         }
2024/08/29 13:01:29 Terraform plan |       + attachment_parameters {
2024/08/29 13:01:29 Terraform plan |           + assessment_id          = "rule-c0314fad-f377-465e-9f16-fa5aa3d5ebbe"
2024/08/29 13:01:29 Terraform plan |           + assessment_type        = "automated"
2024/08/29 13:01:29 Terraform plan |           + parameter_display_name = "IBM Cloud Network Interfaces count"
2024/08/29 13:01:29 Terraform plan |           + parameter_name         = "vm_nic_count"
2024/08/29 13:01:29 Terraform plan |           + parameter_type         = "numeric"
2024/08/29 13:01:29 Terraform plan |           + parameter_value        = "1"
2024/08/29 13:01:29 Terraform plan |         }
2024/08/29 13:01:29 Terraform plan |       + attachment_parameters {
2024/08/29 13:01:29 Terraform plan |           + assessment_id          = "rule-c0f15737-b451-44d0-a0b6-649013a155bc"
2024/08/29 13:01:29 Terraform plan |           + assessment_type        = "automated"
2024/08/29 13:01:29 Terraform plan |           + parameter_display_name = "Number of Direct Links"
2024/08/29 13:01:29 Terraform plan |           + parameter_name         = "number_of_direct_links"
2024/08/29 13:01:29 Terraform plan |           + parameter_type         = "numeric"
2024/08/29 13:01:29 Terraform plan |           + parameter_value        = "2"
2024/08/29 13:01:29 Terraform plan |         }
2024/08/29 13:01:29 Terraform plan |       + attachment_parameters {
2024/08/29 13:01:29 Terraform plan |           + assessment_id          = "rule-c981bedc-1526-448c-836c-10b0e3a2b812"
2024/08/29 13:01:29 Terraform plan |           + assessment_type        = "automated"
2024/08/29 13:01:29 Terraform plan |           + parameter_display_name = "Enter the IP/CIDR list allowed for VPC Outbound"
2024/08/29 13:01:29 Terraform plan |           + parameter_name         = "outbound_allowed_list"
2024/08/29 13:01:29 Terraform plan |           + parameter_type         = "ip_list"
2024/08/29 13:01:29 Terraform plan |           + parameter_value        = "['0.0.0.0/0']"
2024/08/29 13:01:29 Terraform plan |         }
2024/08/29 13:01:29 Terraform plan |       + attachment_parameters {
2024/08/29 13:01:29 Terraform plan |           + assessment_id          = "rule-d42bbc4b-932f-4ffe-9b2b-8d64fe9cf63f"
2024/08/29 13:01:29 Terraform plan |           + assessment_type        = "automated"
2024/08/29 13:01:29 Terraform plan |           + parameter_display_name = "IBM Cloud Public Gateway permitted zones"
2024/08/29 13:01:29 Terraform plan |           + parameter_name         = "public_gateway_permitted_zones"
2024/08/29 13:01:29 Terraform plan |           + parameter_type         = "string_list"
2024/08/29 13:01:29 Terraform plan |           + parameter_value        = "['us-south-1', 'us-south-2', 'us-south-3', 'us-east-1', 'us-east-2', 'us-east-3', 'au-syd-1', 'au-syd-2', 'au-syd-3', 'eu-de-1', 'eu-de-2', 'eu-de-3', 'eu-gb-1', 'eu-gb-2']"
2024/08/29 13:01:29 Terraform plan |         }
2024/08/29 13:01:29 Terraform plan |       + attachment_parameters {
2024/08/29 13:01:29 Terraform plan |           + assessment_id          = "rule-e17c4755-6cef-4e22-84aa-26cfa03b9559"
2024/08/29 13:01:29 Terraform plan |           + assessment_type        = "automated"
2024/08/29 13:01:29 Terraform plan |           + parameter_display_name = "check for cbr enforcement"
2024/08/29 13:01:29 Terraform plan |           + parameter_name         = "check_enforced"
2024/08/29 13:01:29 Terraform plan |           + parameter_type         = "string_list"
2024/08/29 13:01:29 Terraform plan |           + parameter_value        = "['cbr', 'service']"
2024/08/29 13:01:29 Terraform plan |         }
2024/08/29 13:01:29 Terraform plan |       + attachment_parameters {
2024/08/29 13:01:29 Terraform plan |           + assessment_id          = "rule-e208d1c0-8ede-49f0-b4a3-4da3da738733"
2024/08/29 13:01:29 Terraform plan |           + assessment_type        = "automated"
2024/08/29 13:01:29 Terraform plan |           + parameter_display_name = "List of allowed tool integration services for toolchains"
2024/08/29 13:01:29 Terraform plan |           + parameter_name         = "allowed_tool_integration_services"
2024/08/29 13:01:29 Terraform plan |           + parameter_type         = "string_list"
2024/08/29 13:01:29 Terraform plan |           + parameter_value        = "['artifactory', 'customtool', 'draservicebroker', 'githubconsolidated', 'gitlab', 'hashicorpvault', 'hostedgit', 'keyprotect', 'pagerduty', 'pipeline', 'private_worker', 'saucelabs', 'secretsmanager', 'security_compliance', 'slack', 'sonarqube']"
2024/08/29 13:01:29 Terraform plan |         }
2024/08/29 13:01:29 Terraform plan |       + attachment_parameters {
2024/08/29 13:01:29 Terraform plan |           + assessment_id          = "rule-f47c1c7d-cead-4f21-aa71-4fe7a307ae9b"
2024/08/29 13:01:29 Terraform plan |           + assessment_type        = "automated"
2024/08/29 13:01:29 Terraform plan |           + parameter_display_name = "Minimum number of VPC zones"
2024/08/29 13:01:29 Terraform plan |           + parameter_name         = "vpc_min_zones"
2024/08/29 13:01:29 Terraform plan |           + parameter_type         = "numeric"
2024/08/29 13:01:29 Terraform plan |           + parameter_value        = "3"
2024/08/29 13:01:29 Terraform plan |         }
2024/08/29 13:01:29 Terraform plan |       + attachment_parameters {
2024/08/29 13:01:29 Terraform plan |           + assessment_id          = "rule-fbaab096-6c43-4f7e-9655-5bc6b988b933"
2024/08/29 13:01:29 Terraform plan |           + assessment_type        = "automated"
2024/08/29 13:01:29 Terraform plan |           + parameter_display_name = "Count of admin users role in IBM watsonx project."
2024/08/29 13:01:29 Terraform plan |           + parameter_name         = "no_of_admin_users"
2024/08/29 13:01:29 Terraform plan |           + parameter_type         = "numeric"
2024/08/29 13:01:29 Terraform plan |           + parameter_value        = "2"
2024/08/29 13:01:29 Terraform plan |         }
2024/08/29 13:01:29 Terraform plan |
 2024/08/29 13:01:29 Terraform plan |       + notifications {
2024/08/29 13:01:29 Terraform plan |           + enabled = false
2024/08/29 13:01:29 Terraform plan |
 2024/08/29 13:01:29 Terraform plan |           + controls {
2024/08/29 13:01:29 Terraform plan |               + failed_control_ids = []
2024/08/29 13:01:29 Terraform plan |               + threshold_limit    = 14
2024/08/29 13:01:29 Terraform plan |             }
2024/08/29 13:01:29 Terraform plan |         }
2024/08/29 13:01:29 Terraform plan |
 2024/08/29 13:01:29 Terraform plan |       + scope {
2024/08/29 13:01:29 Terraform plan |           + environment = "ibm-cloud"
2024/08/29 13:01:29 Terraform plan |
 2024/08/29 13:01:29 Terraform plan |           + properties {
2024/08/29 13:01:29 Terraform plan |               + name  = "scope_type"
2024/08/29 13:01:29 Terraform plan |               + value = "account"
2024/08/29 13:01:29 Terraform plan |             }
2024/08/29 13:01:29 Terraform plan |           + properties {
2024/08/29 13:01:29 Terraform plan |               + name  = "scope_id"
2024/08/29 13:01:29 Terraform plan |               + value = "85fbf4a5a3d148b1b75b59c610ecc811"
2024/08/29 13:01:29 Terraform plan |             }
2024/08/29 13:01:29 Terraform plan |         }
2024/08/29 13:01:29 Terraform plan |     }
2024/08/29 13:01:29 Terraform plan |
 2024/08/29 13:01:29 Terraform plan | Plan: 1 to add, 0 to change, 0 to destroy.
2024/08/29 13:01:29 Command finished successfully.
 2024/08/29 13:01:29 [34mStarting command: terraform1.6 show -no-color -json tfplan.binary[39m[0m
2024/08/29 13:01:29 Starting command: terraform1.6 show -no-color -json tfplan.binary
2024/08/29 13:01:33 Command finished successfully.
 2024/08/29 13:01:33 [34mStarting command: terraform1.6 apply -state=terraform.tfstate -var-file=schematics.tfvars -auto-approve -no-color[39m[0m
2024/08/29 13:01:33 Starting command: terraform1.6 apply -state=terraform.tfstate -var-file=schematics.tfvars -auto-approve -no-color
2024/08/29 13:01:44 Terraform apply | module.scc[0].data.ibm_iam_account_settings.iam_account_settings: Reading...
2024/08/29 13:01:44 Terraform apply | data.ibm_en_destinations.en_destinations[0]: Reading...
2024/08/29 13:01:44 Terraform apply | module.resource_group.data.ibm_resource_group.existing_resource_group[0]: Reading...
2024/08/29 13:01:44 Terraform apply | data.ibm_iam_account_settings.iam_account_settings: Reading...
2024/08/29 13:01:44 Terraform apply | module.kms[0].module.kms_key_rings["scc-cos-key-ring"].ibm_kms_key_rings.key_ring: Refreshing state... [id=scc-cos-key-ring:keyRing:crn:v1:bluemix:public:kms:us-south:a/85fbf4a5a3d148b1b75b59c610ecc811:c01fb421-74d0-49d5-bda2-e2be1f31cbe9::]
2024/08/29 13:01:45 Terraform apply | data.ibm_iam_account_settings.iam_account_settings: Read complete after 0s [id=85fbf4a5a3d148b1b75b59c610ecc811]
2024/08/29 13:01:45 Terraform apply | module.scc[0].data.ibm_iam_account_settings.iam_account_settings: Read complete after 0s [id=85fbf4a5a3d148b1b75b59c610ecc811]
2024/08/29 13:01:45 Terraform apply | module.resource_group.data.ibm_resource_group.existing_resource_group[0]: Read complete after 0s [id=4f52d93cc67646a8bbde21c8fd4ed1c4]
2024/08/29 13:01:45 Terraform apply | module.cos[0].module.cos_instance[0].ibm_resource_instance.cos_instance[0]: Refreshing state... [id=crn:v1:bluemix:public:cloud-object-storage:global:a/85fbf4a5a3d148b1b75b59c610ecc811:935bb1c1-2bc1-4365-8b15-ec470335bb90::]
2024/08/29 13:01:45 Terraform apply | module.scc[0].ibm_resource_instance.scc_instance: Refreshing state... [id=crn:v1:bluemix:public:compliance:us-south:a/85fbf4a5a3d148b1b75b59c610ecc811:ef71ef26-0e3f-400a-b0ee-0e879ef2d29d::]
2024/08/29 13:01:45 Terraform apply | data.ibm_en_destinations.en_destinations[0]: Read complete after 0s [id=destinations/a32b0edb-ae37-488e-8fdc-69006089f50e]
2024/08/29 13:01:45 Terraform apply | module.kms[0].module.kms_keys["scc-cos-key-ring.scc-cos-key"].ibm_kms_key.key: Refreshing state... [id=crn:v1:bluemix:public:kms:us-south:a/85fbf4a5a3d148b1b75b59c610ecc811:c01fb421-74d0-49d5-bda2-e2be1f31cbe9:key:c57bea05-a1cd-4844-8bfa-338e7e006700]
2024/08/29 13:01:46 Terraform apply | module.scc[0].time_sleep.wait_for_scc_wp_authorization_policy: Refreshing state... [id=2024-08-28T17:45:04Z]
2024/08/29 13:01:46 Terraform apply | module.scc[0].ibm_iam_authorization_policy.scc_cos_s2s_access[0]: Refreshing state... [id=a0ce404e-068a-40ef-b2b7-701ec11b1bf0]
2024/08/29 13:01:46 Terraform apply | module.kms[0].module.kms_keys["scc-cos-key-ring.scc-cos-key"].ibm_kms_key_policies.root_key_policy[0]: Refreshing state... [id=crn:v1:bluemix:public:kms:us-south:a/85fbf4a5a3d148b1b75b59c610ecc811:c01fb421-74d0-49d5-bda2-e2be1f31cbe9:key:c57bea05-a1cd-4844-8bfa-338e7e006700]
2024/08/29 13:01:47 Terraform apply | module.scc[0].time_sleep.wait_for_scc_cos_authorization_policy: Refreshing state... [id=2024-08-28T17:45:05Z]
2024/08/29 13:01:47 Terraform apply | module.cos[0].module.buckets.ibm_iam_authorization_policy.policy[0]: Refreshing state... [id=c4ddc683-3fb6-4681-a771-12a234b46b6e]
2024/08/29 13:01:48 Terraform apply | module.cos[0].module.buckets.time_sleep.wait_for_authorization_policy[0]: Refreshing state... [id=2024-08-28T17:45:04Z]
2024/08/29 13:01:48 Terraform apply | module.cos[0].module.buckets.module.buckets["base-security-services-bucket"].random_string.bucket_name_suffix[0]: Refreshing state... [id=ogq6]
2024/08/29 13:01:49 Terraform apply | module.cos[0].module.buckets.module.buckets["base-security-services-bucket"].ibm_cos_bucket.cos_bucket[0]: Refreshing state... [id=crn:v1:bluemix:public:cloud-object-storage:global:a/85fbf4a5a3d148b1b75b59c610ecc811:935bb1c1-2bc1-4365-8b15-ec470335bb90:bucket:base-security-services-bucket-ogq6:meta:rl:us-south:private]
2024/08/29 13:01:50 Terraform apply | module.scc[0].ibm_scc_instance_settings.scc_instance_settings: Refreshing state... [id=ef71ef26-0e3f-400a-b0ee-0e879ef2d29d]
2024/08/29 13:01:51 Terraform apply | ibm_en_topic.en_topic[0]: Refreshing state... [id=a32b0edb-ae37-488e-8fdc-69006089f50e/fcc69347-6e50-4e2b-8b14-91f5998580a8]
2024/08/29 13:01:51 Terraform apply | module.create_profile_attachment["AI Security Guardrails 2.0"].data.ibm_scc_profiles.scc_profiles: Reading...
2024/08/29 13:01:55 Terraform apply | module.create_profile_attachment["AI Security Guardrails 2.0"].data.ibm_scc_profiles.scc_profiles: Read complete after 3s [id=ef71ef26-0e3f-400a-b0ee-0e879ef2d29d/profiles]
2024/08/29 13:01:55 Terraform apply | module.create_profile_attachment["AI Security Guardrails 2.0"].data.ibm_scc_profile.scc_profile: Reading...
2024/08/29 13:01:59 Terraform apply | module.create_profile_attachment["AI Security Guardrails 2.0"].data.ibm_scc_profile.scc_profile: Read complete after 4s [id=7e09c417-238b-4dca-b086-22170bcf13ea]
2024/08/29 13:02:00 Terraform apply |
 2024/08/29 13:02:00 Terraform apply | Terraform used the selected providers to generate the following execution
2024/08/29 13:02:00 Terraform apply | plan. Resource actions are indicated with the following symbols:
2024/08/29 13:02:00 Terraform apply |   + create
2024/08/29 13:02:00 Terraform apply |
 2024/08/29 13:02:00 Terraform apply | Terraform will perform the following actions:
2024/08/29 13:02:00 Terraform apply |
 2024/08/29 13:02:00 Terraform apply |   # module.create_profile_attachment["AI Security Guardrails 2.0"].ibm_scc_profile_attachment.scc_profile_attachment will be created
2024/08/29 13:02:00 Terraform apply |   + resource "ibm_scc_profile_attachment" "scc_profile_attachment" {
2024/08/29 13:02:00 Terraform apply |       + account_id            = (known after apply)
2024/08/29 13:02:00 Terraform apply |       + attachment_id         = (known after apply)
2024/08/29 13:02:00 Terraform apply |       + created_by            = (known after apply)
2024/08/29 13:02:00 Terraform apply |       + created_on            = (known after apply)
2024/08/29 13:02:00 Terraform apply |       + description           = "SCC profile attachment scoped to your specific IBM Cloud account id 85fbf4a5a3d148b1b75b59c610ecc811 with a daily attachment schedule."
2024/08/29 13:02:00 Terraform apply |       + id                    = (known after apply)
2024/08/29 13:02:00 Terraform apply |       + instance_id           = "ef71ef26-0e3f-400a-b0ee-0e879ef2d29d"
2024/08/29 13:02:00 Terraform apply |       + last_scan             = (known after apply)
2024/08/29 13:02:00 Terraform apply |       + name                  = "1 daily full account attachment"
2024/08/29 13:02:00 Terraform apply |       + next_scan_time        = (known after apply)
2024/08/29 13:02:00 Terraform apply |       + profile_attachment_id = (known after apply)
2024/08/29 13:02:00 Terraform apply |       + profile_id            = "7e09c417-238b-4dca-b086-22170bcf13ea"
2024/08/29 13:02:00 Terraform apply |       + schedule              = "daily"
2024/08/29 13:02:00 Terraform apply |       + status                = "enabled"
2024/08/29 13:02:00 Terraform apply |       + updated_by            = (known after apply)
2024/08/29 13:02:00 Terraform apply |       + updated_on            = (known after apply)
2024/08/29 13:02:00 Terraform apply |
 2024/08/29 13:02:00 Terraform apply |       + attachment_parameters {
2024/08/29 13:02:00 Terraform apply |           + assessment_id          = "rule-045ae3bc-9f3a-46ac-b4e9-7bec574f66d0"
2024/08/29 13:02:00 Terraform apply |           + assessment_type        = "automated"
2024/08/29 13:02:00 Terraform apply |           + parameter_display_name = "check for cbr enforcement"
2024/08/29 13:02:00 Terraform apply |           + parameter_name         = "check_enforced"
2024/08/29 13:02:00 Terraform apply |           + parameter_type         = "string_list"
2024/08/29 13:02:00 Terraform apply |           + parameter_value        = "['cbr', 'service']"
2024/08/29 13:02:00 Terraform apply |         }
2024/08/29 13:02:00 Terraform apply |       + attachment_parameters {
2024/08/29 13:02:00 Terraform apply |           + assessment_id          = "rule-064d9004-8728-4988-b19a-1805710466f6"
2024/08/29 13:02:00 Terraform apply |           + assessment_type        = "automated"
2024/08/29 13:02:00 Terraform apply |           + parameter_display_name = "Number of IBM Cloud Hyper Protect Crypto Service units"
2024/08/29 13:02:00 Terraform apply |           + parameter_name         = "hpcs_crypto_units"
2024/08/29 13:02:00 Terraform apply |           + parameter_type         = "string_list"
2024/08/29 13:02:00 Terraform apply |           + parameter_value        = "['2', '3']"
2024/08/29 13:02:00 Terraform apply |         }
2024/08/29 13:02:00 Terraform apply |       + attachment_parameters {
2024/08/29 13:02:00 Terraform apply |           + assessment_id          = "rule-0be41446-a0e7-46fb-8cbb-37bf413e0286"
2024/08/29 13:02:00 Terraform apply |           + assessment_type        = "automated"
2024/08/29 13:02:00 Terraform apply |           + parameter_display_name = "Minimal number of loadbalancer zones"
2024/08/29 13:02:00 Terraform apply |           + parameter_name         = "loadbalancer_min_lb_zones"
2024/08/29 13:02:00 Terraform apply |           + parameter_type         = "numeric"
2024/08/29 13:02:00 Terraform apply |           + parameter_value        = "3"
2024/08/29 13:02:00 Terraform apply |         }
2024/08/29 13:02:00 Terraform apply |       + attachment_parameters {
2024/08/29 13:02:00 Terraform apply |           + assessment_id          = "rule-0f7e7e60-a05c-43a7-be74-70615f14a342"
2024/08/29 13:02:00 Terraform apply |           + assessment_type        = "automated"
2024/08/29 13:02:00 Terraform apply |           + parameter_display_name = "Security group rule for allowed port numbers to DNS"
2024/08/29 13:02:00 Terraform apply |           + parameter_name         = "dns_port"
2024/08/29 13:02:00 Terraform apply |           + parameter_type         = "numeric"
2024/08/29 13:02:00 Terraform apply |           + parameter_value        = "53"
2024/08/29 13:02:00 Terraform apply |         }
2024/08/29 13:02:00 Terraform apply |       + attachment_parameters {
2024/08/29 13:02:00 Terraform apply |           + assessment_id          = "rule-11425765-ea68-47e7-b4e0-c443ec0cbd19"
2024/08/29 13:02:00 Terraform apply |           + assessment_type        = "automated"
2024/08/29 13:02:00 Terraform apply |           + parameter_display_name = "IP allowlist for Event Streams"
2024/08/29 13:02:00 Terraform apply |           + parameter_name         = "allowed_ip"
2024/08/29 13:02:00 Terraform apply |           + parameter_type         = "ip_list"
2024/08/29 13:02:00 Terraform apply |           + parameter_value        = "['192.168.1.0/24']"
2024/08/29 13:02:00 Terraform apply |         }
2024/08/29 13:02:00 Terraform apply |       + attachment_parameters {
2024/08/29 13:02:00 Terraform apply |           + assessment_id          = "rule-115d9567-067d-48c0-80b5-71642e0217fb"
2024/08/29 13:02:00 Terraform apply |           + assessment_type        = "automated"
2024/08/29 13:02:00 Terraform apply |           + parameter_display_name = "check for cbr enforcement"
2024/08/29 13:02:00 Terraform apply |           + parameter_name         = "check_enforced"
2024/08/29 13:02:00 Terraform apply |           + parameter_type         = "string_list"
2024/08/29 13:02:00 Terraform apply |           + parameter_value        = "['cbr', 'service']"
2024/08/29 13:02:00 Terraform apply |         }
2024/08/29 13:02:00 Terraform apply |       + attachment_parameters {
2024/08/29 13:02:00 Terraform apply |           + assessment_id          = "rule-28271605-31bb-4efa-b0ef-5f51adc77d90"
2024/08/29 13:02:00 Terraform apply |           + assessment_type        = "automated"
2024/08/29 13:02:00 Terraform apply |           + parameter_display_name = "Enter the IP/CIDR list allowed for VPC inbound"
2024/08/29 13:02:00 Terraform apply |           + parameter_name         = "inbound_allowed_list"
2024/08/29 13:02:00 Terraform apply |           + parameter_type         = "ip_list"
2024/08/29 13:02:00 Terraform apply |           + parameter_value        = "['0.0.0.0/0']"
2024/08/29 13:02:00 Terraform apply |         }
2024/08/29 13:02:00 Terraform apply |       + attachment_parameters {
2024/08/29 13:02:00 Terraform apply |           + assessment_id          = "rule-51e15d43-3946-4898-b593-02e16a988d8e"
2024/08/29 13:02:00 Terraform apply |           + assessment_type        = "automated"
2024/08/29 13:02:00 Terraform apply |           + parameter_display_name = "Maximum number of days between vulnerability scans"
2024/08/29 13:02:00 Terraform apply |           + parameter_name         = "scan_interval_max"
2024/08/29 13:02:00 Terraform apply |           + parameter_type         = "numeric"
2024/08/29 13:02:00 Terraform apply |           + parameter_value        = "3"
2024/08/29 13:02:00 Terraform apply |         }
2024/08/29 13:02:00 Terraform apply |       + attachment_parameters {
2024/08/29 13:02:00 Terraform apply |           + assessment_id          = "rule-574143f9-befe-4da1-a15e-af9437ed9ae7"
2024/08/29 13:02:00 Terraform apply |           + assessment_type        = "automated"
2024/08/29 13:02:00 Terraform apply |           + parameter_display_name = "Hyper Protect Crypto Services regions"
2024/08/29 13:02:00 Terraform apply |           + parameter_name         = "fs_cloud_regions"
2024/08/29 13:02:00 Terraform apply |           + parameter_type         = "string_list"
2024/08/29 13:02:00 Terraform apply |           + parameter_value        = "['au-syd', 'br-sao', 'ca-tor', 'eu-de', 'eu-gb', 'jp-osa', 'jp-tok', 'us-east', 'us-south']"
2024/08/29 13:02:00 Terraform apply |         }
2024/08/29 13:02:00 Terraform apply |       + attachment_parameters {
2024/08/29 13:02:00 Terraform apply |           + assessment_id          = "rule-61878b48-e181-455d-aed3-5730b6e27890"
2024/08/29 13:02:00 Terraform apply |           + assessment_type        = "automated"
2024/08/29 13:02:00 Terraform apply |           + parameter_display_name = "check for cbr enforcement"
2024/08/29 13:02:00 Terraform apply |           + parameter_name         = "check_enforced"
2024/08/29 13:02:00 Terraform apply |           + parameter_type         = "string_list"
2024/08/29 13:02:00 Terraform apply |           + parameter_value        = "['cbr', 'service']"
2024/08/29 13:02:00 Terraform apply |         }
2024/08/29 13:02:00 Terraform apply |       + attachment_parameters {
2024/08/29 13:02:00 Terraform apply |           + assessment_id          = "rule-857646d8-23b8-4495-82a4-295ab399266e"
2024/08/29 13:02:00 Terraform apply |           + assessment_type        = "automated"
2024/08/29 13:02:00 Terraform apply |           + parameter_display_name = "At least one VPC created"
2024/08/29 13:02:00 Terraform apply |           + parameter_name         = "number_of_vpcs"
2024/08/29 13:02:00 Terraform apply |           + parameter_type         = "numeric"
2024/08/29 13:02:00 Terraform apply |           + parameter_value        = "1"
2024/08/29 13:02:00 Terraform apply |         }
2024/08/29 13:02:00 Terraform apply |       + attachment_parameters {
2024/08/29 13:02:00 Terraform apply |           + assessment_id          = "rule-88f25dca-0e62-43c1-939e-f6637d23847f"
2024/08/29 13:02:00 Terraform apply |           + assessment_type        = "automated"
2024/08/29 13:02:00 Terraform apply |           + parameter_display_name = "Minimum number of Worker node zones"
2024/08/29 13:02:00 Terraform apply |           + parameter_name         = "worker_node_min_zones"
2024/08/29 13:02:00 Terraform apply |           + parameter_type         = "numeric"
2024/08/29 13:02:00 Terraform apply |           + parameter_value        = "3"
2024/08/29 13:02:00 Terraform apply |         }
2024/08/29 13:02:00 Terraform apply |       + attachment_parameters {
2024/08/29 13:02:00 Terraform apply |           + assessment_id          = "rule-898ff49d-1979-4b70-9a79-d303c88dea63"
2024/08/29 13:02:00 Terraform apply |           + assessment_type        = "automated"
2024/08/29 13:02:00 Terraform apply |           + parameter_display_name = "Exclude interfaces with IP-spoofing from VPC"
2024/08/29 13:02:00 Terraform apply |           + parameter_name         = "exclude_ip_spoofing_check"
2024/08/29 13:02:00 Terraform apply |           + parameter_type         = "string_list"
2024/08/29 13:02:00 Terraform apply |           + parameter_value        = "['vm-qa-automation-prod']"
2024/08/29 13:02:00 Terraform apply |         }
2024/08/29 13:02:00 Terraform apply |       + attachment_parameters {
2024/08/29 13:02:00 Terraform apply |           + assessment_id          = "rule-8c28c15e-c38f-410a-a883-a5f22a839176"
2024/08/29 13:02:00 Terraform apply |           + assessment_type        = "automated"
2024/08/29 13:02:00 Terraform apply |           + parameter_display_name = "Number of transit gateways"
2024/08/29 13:02:00 Terraform apply |           + parameter_name         = "number_of_transit_gateways"
2024/08/29 13:02:00 Terraform apply |           + parameter_type         = "numeric"
2024/08/29 13:02:00 Terraform apply |           + parameter_value        = "1"
2024/08/29 13:02:00 Terraform apply |         }
2024/08/29 13:02:00 Terraform apply |       + attachment_parameters {
2024/08/29 13:02:00 Terraform apply |           + assessment_id          = "rule-97b65986-fd31-459c-9a97-eaa6ad78944b"
2024/08/29 13:02:00 Terraform apply |           + assessment_type        = "automated"
2024/08/29 13:02:00 Terraform apply |           + parameter_display_name = "IP allowlist for COS"
2024/08/29 13:02:00 Terraform apply |           + parameter_name         = "allowed_ip"
2024/08/29 13:02:00 Terraform apply |           + parameter_type         = "ip_list"
2024/08/29 13:02:00 Terraform apply |           + parameter_value        = "['192.168.1.0/24']"
2024/08/29 13:02:00 Terraform apply |         }
2024/08/29 13:02:00 Terraform apply |       + attachment_parameters {
2024/08/29 13:02:00 Terraform apply |           + assessment_id          = "rule-a61e9ad4-1c26-4998-8862-502f0b1c20f5"
2024/08/29 13:02:00 Terraform apply |           + assessment_type        = "automated"
2024/08/29 13:02:00 Terraform apply |           + parameter_display_name = "check for cbr enforcement"
2024/08/29 13:02:00 Terraform apply |           + parameter_name         = "check_enforced"
2024/08/29 13:02:00 Terraform apply |           + parameter_type         = "string_list"
2024/08/29 13:02:00 Terraform apply |           + parameter_value        = "['cbr', 'service']"
2024/08/29 13:02:00 Terraform apply |         }
2024/08/29 13:02:00 Terraform apply |       + attachment_parameters {
2024/08/29 13:02:00 Terraform apply |           + assessment_id          = "rule-c0314fad-f377-465e-9f16-fa5aa3d5ebbe"
2024/08/29 13:02:00 Terraform apply |           + assessment_type        = "automated"
2024/08/29 13:02:00 Terraform apply |           + parameter_display_name = "IBM Cloud Network Interfaces count"
2024/08/29 13:02:00 Terraform apply |           + parameter_name         = "vm_nic_count"
2024/08/29 13:02:00 Terraform apply |           + parameter_type         = "numeric"
2024/08/29 13:02:00 Terraform apply |           + parameter_value        = "1"
2024/08/29 13:02:00 Terraform apply |         }
2024/08/29 13:02:00 Terraform apply |       + attachment_parameters {
2024/08/29 13:02:00 Terraform apply |           + assessment_id          = "rule-c0f15737-b451-44d0-a0b6-649013a155bc"
2024/08/29 13:02:00 Terraform apply |           + assessment_type        = "automated"
2024/08/29 13:02:00 Terraform apply |           + parameter_display_name = "Number of Direct Links"
2024/08/29 13:02:00 Terraform apply |           + parameter_name         = "number_of_direct_links"
2024/08/29 13:02:00 Terraform apply |           + parameter_type         = "numeric"
2024/08/29 13:02:00 Terraform apply |           + parameter_value        = "2"
2024/08/29 13:02:00 Terraform apply |         }
2024/08/29 13:02:00 Terraform apply |       + attachment_parameters {
2024/08/29 13:02:00 Terraform apply |           + assessment_id          = "rule-c981bedc-1526-448c-836c-10b0e3a2b812"
2024/08/29 13:02:00 Terraform apply |           + assessment_type        = "automated"
2024/08/29 13:02:00 Terraform apply |           + parameter_display_name = "Enter the IP/CIDR list allowed for VPC Outbound"
2024/08/29 13:02:00 Terraform apply |           + parameter_name         = "outbound_allowed_list"
2024/08/29 13:02:00 Terraform apply |           + parameter_type         = "ip_list"
2024/08/29 13:02:00 Terraform apply |           + parameter_value        = "['0.0.0.0/0']"
2024/08/29 13:02:00 Terraform apply |         }
2024/08/29 13:02:00 Terraform apply |       + attachment_parameters {
2024/08/29 13:02:00 Terraform apply |           + assessment_id          = "rule-d42bbc4b-932f-4ffe-9b2b-8d64fe9cf63f"
2024/08/29 13:02:00 Terraform apply |           + assessment_type        = "automated"
2024/08/29 13:02:00 Terraform apply |           + parameter_display_name = "IBM Cloud Public Gateway permitted zones"
2024/08/29 13:02:00 Terraform apply |           + parameter_name         = "public_gateway_permitted_zones"
2024/08/29 13:02:00 Terraform apply |           + parameter_type         = "string_list"
2024/08/29 13:02:00 Terraform apply |           + parameter_value        = "['us-south-1', 'us-south-2', 'us-south-3', 'us-east-1', 'us-east-2', 'us-east-3', 'au-syd-1', 'au-syd-2', 'au-syd-3', 'eu-de-1', 'eu-de-2', 'eu-de-3', 'eu-gb-1', 'eu-gb-2']"
2024/08/29 13:02:00 Terraform apply |         }
2024/08/29 13:02:00 Terraform apply |       + attachment_parameters {
2024/08/29 13:02:00 Terraform apply |           + assessment_id          = "rule-e17c4755-6cef-4e22-84aa-26cfa03b9559"
2024/08/29 13:02:00 Terraform apply |           + assessment_type        = "automated"
2024/08/29 13:02:00 Terraform apply |           + parameter_display_name = "check for cbr enforcement"
2024/08/29 13:02:00 Terraform apply |           + parameter_name         = "check_enforced"
2024/08/29 13:02:00 Terraform apply |           + parameter_type         = "string_list"
2024/08/29 13:02:00 Terraform apply |           + parameter_value        = "['cbr', 'service']"
2024/08/29 13:02:00 Terraform apply |         }
2024/08/29 13:02:00 Terraform apply |       + attachment_parameters {
2024/08/29 13:02:00 Terraform apply |           + assessment_id          = "rule-e208d1c0-8ede-49f0-b4a3-4da3da738733"
2024/08/29 13:02:00 Terraform apply |           + assessment_type        = "automated"
2024/08/29 13:02:00 Terraform apply |           + parameter_display_name = "List of allowed tool integration services for toolchains"
2024/08/29 13:02:00 Terraform apply |           + parameter_name         = "allowed_tool_integration_services"
2024/08/29 13:02:00 Terraform apply |           + parameter_type         = "string_list"
2024/08/29 13:02:00 Terraform apply |           + parameter_value        = "['artifactory', 'customtool', 'draservicebroker', 'githubconsolidated', 'gitlab', 'hashicorpvault', 'hostedgit', 'keyprotect', 'pagerduty', 'pipeline', 'private_worker', 'saucelabs', 'secretsmanager', 'security_compliance', 'slack', 'sonarqube']"
2024/08/29 13:02:00 Terraform apply |         }
2024/08/29 13:02:00 Terraform apply |       + attachment_parameters {
2024/08/29 13:02:00 Terraform apply |           + assessment_id          = "rule-f47c1c7d-cead-4f21-aa71-4fe7a307ae9b"
2024/08/29 13:02:00 Terraform apply |           + assessment_type        = "automated"
2024/08/29 13:02:00 Terraform apply |           + parameter_display_name = "Minimum number of VPC zones"
2024/08/29 13:02:00 Terraform apply |           + parameter_name         = "vpc_min_zones"
2024/08/29 13:02:00 Terraform apply |           + parameter_type         = "numeric"
2024/08/29 13:02:00 Terraform apply |           + parameter_value        = "3"
2024/08/29 13:02:00 Terraform apply |         }
2024/08/29 13:02:00 Terraform apply |       + attachment_parameters {
2024/08/29 13:02:00 Terraform apply |           + assessment_id          = "rule-fbaab096-6c43-4f7e-9655-5bc6b988b933"
2024/08/29 13:02:00 Terraform apply |           + assessment_type        = "automated"
2024/08/29 13:02:00 Terraform apply |           + parameter_display_name = "Count of admin users role in IBM watsonx project."
2024/08/29 13:02:00 Terraform apply |           + parameter_name         = "no_of_admin_users"
2024/08/29 13:02:00 Terraform apply |           + parameter_type         = "numeric"
2024/08/29 13:02:00 Terraform apply |           + parameter_value        = "2"
2024/08/29 13:02:00 Terraform apply |         }
2024/08/29 13:02:00 Terraform apply |
 2024/08/29 13:02:00 Terraform apply |       + notifications {
2024/08/29 13:02:00 Terraform apply |           + enabled = false
2024/08/29 13:02:00 Terraform apply |
 2024/08/29 13:02:00 Terraform apply |           + controls {
2024/08/29 13:02:00 Terraform apply |               + failed_control_ids = []
2024/08/29 13:02:00 Terraform apply |               + threshold_limit    = 14
2024/08/29 13:02:00 Terraform apply |             }
2024/08/29 13:02:00 Terraform apply |         }
2024/08/29 13:02:00 Terraform apply |
 2024/08/29 13:02:00 Terraform apply |       + scope {
2024/08/29 13:02:00 Terraform apply |           + environment = "ibm-cloud"
2024/08/29 13:02:00 Terraform apply |
 2024/08/29 13:02:00 Terraform apply |           + properties {
2024/08/29 13:02:00 Terraform apply |               + name  = "scope_type"
2024/08/29 13:02:00 Terraform apply |               + value = "account"
2024/08/29 13:02:00 Terraform apply |             }
2024/08/29 13:02:00 Terraform apply |           + properties {
2024/08/29 13:02:00 Terraform apply |               + name  = "scope_id"
2024/08/29 13:02:00 Terraform apply |               + value = "85fbf4a5a3d148b1b75b59c610ecc811"
2024/08/29 13:02:00 Terraform apply |             }
2024/08/29 13:02:00 Terraform apply |         }
2024/08/29 13:02:00 Terraform apply |     }
2024/08/29 13:02:00 Terraform apply |
 2024/08/29 13:02:00 Terraform apply | Plan: 1 to add, 0 to change, 0 to destroy.
2024/08/29 13:02:04 Terraform apply | module.create_profile_attachment["AI Security Guardrails 2.0"].ibm_scc_profile_attachment.scc_profile_attachment: Creating...
2024/08/29 13:02:07 Terraform apply |
 2024/08/29 13:02:07 Terraform apply | Error: CreateAttachmentWithContext failed Necessary attachment parameters are not available to create or update attachment.
2024/08/29 13:02:07 Terraform apply | {
2024/08/29 13:02:07 Terraform apply |     "StatusCode": 400,
2024/08/29 13:02:07 Terraform apply |     "Headers": {
2024/08/29 13:02:07 Terraform apply |         "Cache-Control": [
2024/08/29 13:02:07 Terraform apply |             "no-store"
2024/08/29 13:02:07 Terraform apply |         ],
2024/08/29 13:02:07 Terraform apply |         "Cf-Cache-Status": [
2024/08/29 13:02:07 Terraform apply |             "DYNAMIC"
2024/08/29 13:02:07 Terraform apply |         ],
2024/08/29 13:02:07 Terraform apply |         "Cf-Ray": [
2024/08/29 13:02:07 Terraform apply |             "8bacbbc06b958d26-DFW"
2024/08/29 13:02:07 Terraform apply |         ],
2024/08/29 13:02:07 Terraform apply |         "Content-Length": [
2024/08/29 13:02:07 Terraform apply |             "176"
2024/08/29 13:02:07 Terraform apply |         ],
2024/08/29 13:02:07 Terraform apply |         "Content-Type": [
2024/08/29 13:02:07 Terraform apply |             "application/json; charset=utf-8"
2024/08/29 13:02:07 Terraform apply |         ],
2024/08/29 13:02:07 Terraform apply |         "Date": [
2024/08/29 13:02:07 Terraform apply |             "Thu, 29 Aug 2024 13:02:07 GMT"
2024/08/29 13:02:07 Terraform apply |         ],
2024/08/29 13:02:07 Terraform apply |         "Server": [
2024/08/29 13:02:07 Terraform apply |             "cloudflare"
2024/08/29 13:02:07 Terraform apply |         ],
2024/08/29 13:02:07 Terraform apply |         "Strict-Transport-Security": [
2024/08/29 13:02:07 Terraform apply |             "max-age=31536000; includeSubDomains"
2024/08/29 13:02:07 Terraform apply |         ],
2024/08/29 13:02:07 Terraform apply |         "Transaction-Id": [
2024/08/29 13:02:07 Terraform apply |             "3c179d2d-2ef8-4e90-98e5-7c28462ac524"
2024/08/29 13:02:07 Terraform apply |         ],
2024/08/29 13:02:07 Terraform apply |         "X-Content-Type-Options": [
2024/08/29 13:02:07 Terraform apply |             "nosniff"
2024/08/29 13:02:07 Terraform apply |         ],
2024/08/29 13:02:07 Terraform apply |         "X-Correlation-Id": [
2024/08/29 13:02:07 Terraform apply |             "dc2a5c3f-e60a-44d2-a68c-373e92564bf5"
2024/08/29 13:02:07 Terraform apply |         ],
2024/08/29 13:02:07 Terraform apply |         "X-Envoy-Upstream-Service-Time": [
2024/08/29 13:02:07 Terraform apply |             "2270"
2024/08/29 13:02:07 Terraform apply |         ],
2024/08/29 13:02:07 Terraform apply |         "X-Request-Id": [
2024/08/29 13:02:07 Terraform apply |             "18481f9d-7683-4313-bd05-8f81f7902f77"
2024/08/29 13:02:07 Terraform apply |         ]
2024/08/29 13:02:07 Terraform apply |     },
2024/08/29 13:02:07 Terraform apply |     "Result": {
2024/08/29 13:02:07 Terraform apply |         "errors": [
2024/08/29 13:02:07 Terraform apply |             {
2024/08/29 13:02:07 Terraform apply |                 "code": "bad_request",
2024/08/29 13:02:07 Terraform apply |                 "message": "Necessary attachment parameters are not available to create or update attachment."
2024/08/29 13:02:08 Terraform apply |             }
2024/08/29 13:02:08 Terraform apply |         ],
2024/08/29 13:02:08 Terraform apply |         "trace": "dc2a5c3f-e60a-44d2-a68c-373e92564bf5"
2024/08/29 13:02:08 Terraform apply |     },
2024/08/29 13:02:08 Terraform apply |     "RawResult": null
2024/08/29 13:02:08 Terraform apply | }
2024/08/29 13:02:08 Terraform apply |
 2024/08/29 13:02:08 Terraform apply |
 2024/08/29 13:02:08 Terraform apply |   with module.create_profile_attachment["AI Security Guardrails 2.0"].ibm_scc_profile_attachment.scc_profile_attachment,
2024/08/29 13:02:08 Terraform apply |   on .terraform/modules/create_profile_attachment/modules/attachment/main.tf line 43, in resource "ibm_scc_profile_attachment" "scc_profile_attachment":
2024/08/29 13:02:08 Terraform apply |   43: resource "ibm_scc_profile_attachment" "scc_profile_attachment" {
2024/08/29 13:02:08 Terraform apply |
```